[
    {
        "ref": "https://bpampel.de/zettel/wagniskapital_21-09-20.html",
        "title": "Politische Förderung von Wagniskapital",
        "section": "",
        "tags": ["Philosophie","Gesellschaft","Geschichte","Zukunft","Klima"],
        "date" : "0001.01.01",
        "body": "In diesem Artikel von Franziska Cooiman und Helene Thaa kritisieren die Autorinnen die Förderung von Wagniskapital durch die Parteien als falsch.\nWagniskapital bezeichnet das Einbringen von Geld in kleine, risikoreiche Unternehmen. Im Gegenzug erhält der Kapitalgeber Anteile am Unternehmen. Kleine Unternehmen bekommen Geld sonst oft nur schwer, oder unter sehr hohen Zinsen.\nEs hat das Image Ideen von kleinen Unternehmen zu fördern und dadurch Innovationen anzutreiben. Das entlarven die Autorinnen aber als nur halbwahr:\nIn der Finanzwelt gilt: Hohe Risiken erfordern hohe Gewinne. Da das Geschäft mit jungen Unternehmungen sehr viel Unsicherheit mit sich bringt, müssen die wenigen Startups, die es schaffen – die sogenannten Einhörner –, extrem lukrativ sein. Wagniskapital fließt also vor allem in Startups, die das Potenzial haben, in kurzer Zeit sehr profitabel zu werden – etwa, weil sie skalierbare Produkte anbieten, in monopolistische Märkte einsteigen oder mit bewährten Technologien arbeiten.\nAußerdem also entscheiden einige wenige (private) Investoren wohin Geld fließt, was natürlich eine Kopplung mit den Interessen der Wohlhabenderen bedingt. Es gilt also: Wenn der Staat sich an Wagniskapitalgesellschaften beteiligt kann er zwar etwas auf die zu fördernden Projekte einwirken, beteiligt sich aber an einem zutiefst kapitalistischen und undemokratischem System. Die Autorinnen sagen folgerichtig\nDie Finanzierungsform der Technologien von morgen sollte nicht länger auf Profit ausgerichtet sein, sondern demokratisch verhandelt und an gesamtgesellschaftliche Bedürfnisse gekoppelt werden.\nund schlagen kollektive Kapitalfonds als Alternative vor, in welchen aufgrund politischer ausgehandelter Prioritäten von den konkret Betroffenen entschieden wird, welche Unternehmungen gefördert werden sollen.\n"
    }
,
    {
        "ref": "https://bpampel.de/zettel/retrotopie_21-04-06.html",
        "title": "Retrotopie führt zu gesellschaftlichen Konflikten",
        "section": "",
        "tags": ["Philosophie","Gesellschaft","Geschichte","Zukunft","Klima"],
        "date" : "0001.01.01",
        "body": "Wenn es keine gemeinsame Vision der Zukunft gibt (z.B. angesichts der kommenden Klimakatastrophe), sorgen die rückwärts gewandten Visionen für Konflikte zwischen den Generationen.\nAus einem Interview mit Philipp Blom in der HDP:\nhpd: Der Soziologe Zygmunt Baumann sprach in diesem Zusammenhang einmal von \u0026ldquo;Retrotopie\u0026rdquo;. Die Idee des Fortschritts verheiße heute weniger die Aussicht auf eine Verbesserung der persönlichen Lage als die Angst davor, abgehängt und zurückgelassen zu werden. Daher würden sich viele von der Zukunft abwenden und sich nach der Rückkehr einer verklärten Vergangenheit sehnen. Es ist gewissermaßen die Hoffnung, dass es wieder so wird, wie es niemals war. Philipp Blom: Ja, so ist das. Wie die Welt eigentlich zu sein hat und was normal ist, wird in den allermeisten Fällen durch die Kindheit definiert. Lange Zeit waren das aus verständlichen biografischen Gründen die Fünfzigerjahre. Zufälligerweise sind wir alle aber zu unterschiedlichen Zeitpunkten Kinder gewesen. Die verschiedenen Vorstellungen von dem, was als \u0026ldquo;normal\u0026rdquo; anzusehen ist, sind deshalb mit Konflikten verbunden, auch weil es keine gemeinsame Vision einer vernünftigen Zukunft zu geben scheint.\n"
    }
]
